# Basic statistics 
In this section we will discuss how to find the basic statstics using python.

#### Loading the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

#### Loading the dataset

In [3]:
data = pd.read_csv('./sample_students_scores.csv')
data.head(10)

  Student  Age  Math  Science  English
0       A   15    78       85       82
1       B   14    88       79       85
2       C   15    92       91       89
3       D   14    69       72       70
4       E   15    80       83       78
5       F   14    85       77       88
6       G   15    74       80       79
7       H   14    90       89       92

#### Mean

In [4]:
data.Age.mean()

14.5

In [5]:
data.Math.mean()

82.0

In [6]:
data.Science.mean()

82.0

In [7]:
data.English.mean()

82.875

#### Median

In [8]:
data.Age.median()

14.5

In [9]:
data.Math.median()

82.5

#### Mode

In [10]:
data.Age.mode()

0    14
1    15
Name: Age, dtype: int64

In [11]:
data.Math.mode()

0    69
1    74
2    78
3    80
4    85
5    88
6    90
7    92
Name: Math, dtype: int64

In [12]:
data.Science.mode()

0    72
1    77
2    79
3    80
4    83
5    85
6    89
7    91
Name: Science, dtype: int64

#### Correlation

- Lets select only the numerical values

In [14]:
data_numerical = data.select_dtypes(int)
data_numerical.sample(5)

   Age  Math  Science  English
6   15    74       80       79
5   14    85       77       88
4   15    80       83       78
7   14    90       89       92
3   14    69       72       70

In [15]:
data_numerical.corr()

              Age      Math   Science   English
Age      1.000000 -0.131590  0.466504 -0.131007
Math    -0.131590  1.000000  0.683632  0.921070
Science  0.466504  0.683632  1.000000  0.685762
English -0.131007  0.921070  0.685762  1.000000